const translations = {
  header: {
    text1: "Главная",
    text2: "Каталог",
    text3: "Настройки",
    text4: "Мой аккаунт",
    text5: "Загрузки"
  },
  footer: {
    text1: "DMCA",
    text2: "Мы не хостим файлы и не несем ответственности за авторские права на содержимое. По вопросам авторских прав или претензиям обращайтесь напрямую к лицу или организации, которые размещают соответствующий контент.",
    text3: "Сети"
  },
  home: {
    text1: "Информация",
    text2: "Боевики",
    text3: "Анимация",
    text4: "Приключения",
    text5: "Комедия",
    text6: "Больше жанров"
  },
  genres: [
    "Боевик",
    "Анимация",
    "Приключения",
    "Комедия",
    "Криминал",
    "Дебаты",
    "Документальный",
    "Драма",
    "Детям",
    "Семейный",
    "Фэнтези",
    "Мелодрама",
    "Военный",
    "Исторический",
    "Ужасы",
    "Музыка",
    "Детектив",
    "Политика",
    "Романтика",
    "Научная фантастика",
    "Реалити-шоу",
    "Телефильм",
    "Триллер",
    "Вестерн"
  ],
  error404: {
    title: "Ошибка 404",
    description: "Здесь ничего нет...",
    btn: "Вернуться в меню"
  },
  error500: {
    title: "Ошибка 500",
    description: "Сайт в настоящее время на обслуживании"
  },
  search: {
    title: "Ищете что-то конкретное?",
    input: "Поиск фильма, сериала, аниме..."
  },
  item: {
    play: "Смотреть",
    btn1: "Сезоны",
    btn2: "Похожие материалы",
    btn3: "К просмотру",
    btn4: "Кастинг"
  },
  adblock: {
    title: "Обнаружен блокировщик рекламы",
    description: "Мы предоставляем бесплатный сервис, финансируемый за счёт рекламы. Мы следим за тем, чтобы реклама не была навязчивой. Пожалуйста, отключите блокировщик рекламы или оформите подписку."
  },
  watch: {
    txt1: "Качество",
    txt2: "Языки",
    txt3: "Субтитры"
  },
  account: {
    txt1: "Войти",
    txt2: "Пожалуйста, введите ваши учетные данные",
    txt3: "Создать аккаунт",
    txt4: "Безопасность и конфиденциальность — наши приоритеты. Мы не ведём журналы активности и не собираем личную информацию. При удалении аккаунта все связанные данные полностью удаляются — никакой информации, связанной с аккаунтом, не остаётся. Мы не сохраняем ваш IP-адрес. Для повышения анонимности наш сайт доступен через .onion сервис в сети Tor, а также через Lokinet. Эти варианты предоставляют дополнительные уровни безопасности и анонимности для пользователей, которые этого хотят.",
    txt5: "⚠ Очень важно: сохраните ваши учетные данные ⚠",
    txt6: "Сохранено",
    txt7: "Успешно сохранено",
    txt8: "Все коды должны содержать 10 символов",
    txt9: "Ошибка: коды неверны",
    txt10: "Аккаунт",
    txt11: "Список желаний",
    txt12: "Список для просмотра",
    txt13: "Сессии",
    txt14: "Название сессии:",
    txt15: "Нажмите, чтобы удалить",
    txt16: "Неактивна",
    txt17: "Активна до:",
    txt18: "Премиум статус:",
    txt19: "Удалить мой аккаунт"
  },
  settings: {
    txt1: "Настройки",
    txt2: "Автоматически пропускать вступление",
    txt3: "Автоматически пропускать концовку",
    txt4: "Нет"
  },
  yes: "да",
  no: "нет",
  download: {
    title: "Скачать"
  }
};

export default translations;