(globalThis.TURBOPACK || (globalThis.TURBOPACK = [])).push([typeof document === "object" ? document.currentScript : undefined,
"[project]/src/langs/ar.ts [app-client] (ecmascript)", ((__turbopack_context__) => {
"use strict";

__turbopack_context__.s([
    "default",
    ()=>__TURBOPACK__default__export__
]);
const translations = {
    header: {
        text1: "الرئيسية",
        text2: "المكتبة",
        text3: "الإعدادات",
        text4: "حسابي",
        text5: "التنزيلات"
    },
    footer: {
        text1: "DMCA",
        text2: "نحن لا نستضيف أي ملفات ولا نتحمل مسؤولية حقوق النشر المتعلقة بأي محتوى. لأي استفسارات أو مطالبات بخصوص حقوق النشر، يرجى التواصل مباشرة مع الشخص أو الجهة التي تستضيف المحتوى.",
        text3: "الشبكات"
    },
    home: {
        text1: "معلومات",
        text2: "أكشن",
        text3: "رسوم متحركة",
        text4: "مغامرات",
        text5: "كوميديا",
        text6: "المزيد من التصنيفات"
    },
    genres: [
        "أكشن",
        "رسوم متحركة",
        "مغامرة",
        "كوميديا",
        "جريمة",
        "مناظرة",
        "وثائقي",
        "دراما",
        "أطفال",
        "عائلي",
        "فانتازيا",
        "مسلسل",
        "حرب",
        "تاريخي",
        "رعب",
        "موسيقى",
        "غموض",
        "سياسة",
        "رومانس",
        "خيال علمي",
        "برامج الواقع",
        "فيلم تلفزيوني",
        "إثارة",
        "غرب أمريكي"
    ],
    error404: {
        title: "خطأ 404",
        description: "لا يوجد شيء هنا...",
        btn: "العودة إلى القائمة"
    },
    error500: {
        title: "خطأ 500",
        description: "الموقع حالياً قيد الصيانة"
    },
    search: {
        title: "هل تبحث عن شيء معين؟",
        input: "ابحث عن فيلم، مسلسل، أنمي..."
    },
    item: {
        play: "مشاهدة",
        btn1: "المواسم",
        btn2: "محتوى مشابه",
        btn3: "للمشاهدة",
        btn4: "التمثيل"
    },
    adblock: {
        title: "تم اكتشاف مانع الإعلانات",
        description: "نقدم خدمة مجانية ممولة عن طريق الإعلانات. نضمن أن تكون غير متطفلة. يرجى تعطيل مانع الإعلانات أو الاشتراك في خطة."
    },
    watch: {
        txt1: "الجودة",
        txt2: "اللغات",
        txt3: "الترجمة"
    },
    account: {
        txt1: "تسجيل الدخول",
        txt2: "الرجاء إدخال بيانات الاعتماد الخاصة بك",
        txt3: "إنشاء حساب",
        txt4: "الأمن والخصوصية من أولوياتنا. نحن لا نحتفظ بسجلات النشاط ولا يتم جمع أي معلومات شخصية. عندما تحذف حسابك، تُحذف كل البيانات المرتبطة به نهائياً — لا يبقى أي معلومات متعلقة بحسابك. نحن لا نخزن عنوان IP الخاص بك. لتعزيز مستوى عدم الكشف عن الهوية، يمكن الوصول إلى موقعنا عبر خدمة .onion على شبكة تور وكذلك عبر Lokinet. توفر هذه الخيارات طبقات إضافية من الأمان والخصوصية للمستخدمين الراغبين.",
        txt5: "⚠ مهم جداً: احفظ بيانات الدخول الخاصة بك ⚠",
        txt6: "تم الحفظ",
        txt7: "تم الحفظ بنجاح",
        txt8: "يجب أن يتكون كل رمز من 10 أحرف",
        txt9: "خطأ: الرموز غير صحيحة",
        txt10: "الحساب",
        txt11: "قائمة الأمنيات",
        txt12: "قائمة المشاهدة",
        txt13: "الجلسات",
        txt14: "اسم الجلسة:",
        txt15: "انقر للحذف",
        txt16: "غير نشط",
        txt17: "نشط حتى:",
        txt18: "حالة البريميوم:",
        txt19: "حذف حسابي"
    },
    settings: {
        txt1: "الإعدادات",
        txt2: "تخطي المقدمة تلقائياً",
        txt3: "تخطي النهاية تلقائياً",
        txt4: "لا شيء"
    },
    yes: "نعم",
    no: "لا",
    download: {
        title: "تحميل"
    }
};
const __TURBOPACK__default__export__ = translations;
if (typeof globalThis.$RefreshHelpers$ === 'object' && globalThis.$RefreshHelpers !== null) {
    __turbopack_context__.k.registerExports(__turbopack_context__.m, globalThis.$RefreshHelpers$);
}
}),
]);

//# sourceMappingURL=src_langs_ar_ts_05d61815._.js.map