module.exports = [
"[project]/src/langs/hi.ts [app-ssr] (ecmascript)", ((__turbopack_context__) => {
"use strict";

__turbopack_context__.s([
    "default",
    ()=>__TURBOPACK__default__export__
]);
const translations = {
    header: {
        text1: "होम",
        text2: "कैटलॉग",
        text3: "सेटिंग्स",
        text4: "मेरा अकाउंट",
        text5: "डाउनलोड्स"
    },
    footer: {
        text1: "DMCA",
        text2: "हम किसी भी फ़ाइल की मेज़बानी नहीं करते हैं और किसी भी सामग्री से संबंधित कॉपीराइट के लिए जिम्मेदार नहीं हैं। किसी भी कॉपीराइट प्रश्न या दावा के लिए कृपया सीधे उस व्यक्ति या संस्था से संपर्क करें जो सामग्री की मेज़बानी करती है।",
        text3: "नेटवर्क्स"
    },
    home: {
        text1: "जानकारी",
        text2: "एक्शन",
        text3: "एनीमेशन",
        text4: "एडवेंचर",
        text5: "कॉमेडी",
        text6: "और शैलियाँ"
    },
    genres: [
        "एक्शन",
        "एनीमेशन",
        "एडवेंचर",
        "कॉमेडी",
        "क्राइम",
        "डिबेट",
        "डॉक्यूमेंटरी",
        "ड्रामा",
        "किड्स",
        "फैमिली",
        "फैंटेसी",
        "सीरियल",
        "वार",
        "ऐतिहासिक",
        "हॉरर",
        "म्यूजिक",
        "मिस्ट्री",
        "पॉलिटिक्स",
        "रोमांस",
        "साइंस फिक्शन",
        "रिएलिटी टीवी",
        "टीवी फिल्म",
        "थ्रिलर",
        "वेस्टर्न"
    ],
    error404: {
        title: "त्रुटि 404",
        description: "यहाँ कुछ नहीं है...",
        btn: "मेन्यू पर वापस जाएँ"
    },
    error500: {
        title: "त्रुटि 500",
        description: "साइट वर्तमान में मेंटेनेंस पर है"
    },
    search: {
        title: "किसी खास चीज़ की तलाश है?",
        input: "किसी फिल्म, सीरीज़, एनीमे की खोज करें..."
    },
    item: {
        play: "देखें",
        btn1: "सीज़न",
        btn2: "समान सामग्री",
        btn3: "देखने के लिए",
        btn4: "कास्टिंग"
    },
    adblock: {
        title: "ऐड ब्लॉकर पाया गया",
        description: "हम विज्ञापन द्वारा वित्तपोषित एक मुफ्त सेवा प्रदान करते हैं। हम सुनिश्चित करते हैं कि यह आक्रामक न हो। कृपया अपना ऐड-ब्लॉकर अक्षम करें या किसी प्लान की सदस्यता लें।"
    },
    watch: {
        txt1: "क्वालिटी",
        txt2: "भाषाएँ",
        txt3: "सबटाइटल्स"
    },
    account: {
        txt1: "साइन इन",
        txt2: "कृपया अपनी क्रेडेंशियल दर्ज करें",
        txt3: "एक अकाउंट बनाएं",
        txt4: "सुरक्षा और गोपनीयता हमारी प्राथमिकताओं में से हैं। हम गतिविधि लॉग नहीं रखते और कोई व्यक्तिगत जानकारी संग्रहित नहीं करते। जब आप अपना अकाउंट हटाते हैं, तो सभी संबंधित डेटा स्थायी रूप से हटा दिए जाते हैं — आपके अकाउंट से जुड़ी कोई जानकारी बनी नहीं रहती। हम आपका IP पता संग्रहीत नहीं करते। अपनी गुमनामी बढ़ाने के लिए, हमारी साइट Tor नेटवर्क पर .onion सेवा और Lokinet के माध्यम से भी उपलब्ध है। ये विकल्प उपयोगकर्ताओं को अतिरिक्त सुरक्षा और गुमनामी की परतें प्रदान करते हैं।",
        txt5: "⚠ बहुत महत्वपूर्ण: अपनी क्रेडेंशियल बैकअप करें ⚠",
        txt6: "बैक्ड अप",
        txt7: "सही तरीके से बैक्ड अप",
        txt8: "सभी कोड 10 अंकों के होने चाहिए",
        txt9: "त्रुटि: कोड गलत हैं",
        txt10: "अकाउंट",
        txt11: "विशलिस्ट",
        txt12: "वॉचलिस्ट",
        txt13: "सत्र",
        txt14: "सत्र का नाम:",
        txt15: "हटाने के लिए क्लिक करें",
        txt16: "निष्क्रिय",
        txt17: "सक्रिय तक:",
        txt18: "प्रीमियम स्थिति:",
        txt19: "मेरा अकाउंट हटाएँ"
    },
    settings: {
        txt1: "सेटिंग्स",
        txt2: "इंट्रो स्वचालित रूप से छोड़ें",
        txt3: "आउट्रो स्वचालित रूप से छोड़ें",
        txt4: "कोई नहीं"
    },
    yes: "हाँ",
    no: "नहीं",
    download: {
        title: "डाउनलोड"
    }
};
const __TURBOPACK__default__export__ = translations;
}),
];

//# sourceMappingURL=src_langs_hi_ts_4ea6237a._.js.map